In [1]:
import pandas as pd

In [2]:
data = {
    "id": [5, 13, 11, 10, 19, 18, 20, 21, 22, 23, 25, 26, 27, 29, 28, 6, 7, 9, 17, 12, 14, 16, 15, 24, 30, 8, 1, 2, 3, 4],
    "first_name": ["Max", "Katty", "Richerd", "Jennifer", "George", "Laila", "Sarrah", "Suzan", "Mandy", "Britney", "Jack", "Ben", "Tom", "Antoney", "Morgan", "Molly", "Nicky", "Monika", "Mick", "Shandler", "Jason", "Celine", "Michale", "Adam", "Mark", "John", "Allen", "Joe", "Henry", "Sam"],
    "last_name": ["George", "Bond", "Gear", "Dion", "Joe", "Mark", "Bicky", "Lee", "John", "Berry", "Mick", "Ten", "Fridy", "Adam", "Matt", "Sam", "Bat", "William", "Berry", "Bing", "Tom", "Anston", "Jackson", "Morris", "Jon", "Ford", "Wang", "Jack", "Ted", "Mark"],
    "age": [26, 56, 57, 34, 50, 26, 31, 34, 31, 45, 29, 43, 32, 34, 25, 28, 33, 33, 44, 23, 23, 27, 44, 30, 28, 26, 55, 32, 31, 25],
    "sex": ["M", "F", "M", "F", "M", "F", "F", "F", "F", "F", "M", "M", "M", "M", "M", "F", "F", "F", "M", "M", "M", "F", "F", "M", "M", "M", "F", "M", "M", "M"],
    "employee_title": ["Sales", "Manager", "Manager", "Sales", "Manager", "Sales", "Senior Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Senior Sales", "Auditor", "Auditor", "Auditor", "Auditor", "Sales", "Sales", "Senior Sales", "Manager", "Sales", "Senior Sales", "Sales"],
    "department": ["Sales", "Management", "Management", "Sales", "Management", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Sales", "Audit", "Audit", "Audit", "Audit", "Sales", "Sales", "Sales", "Management", "Sales", "Sales", "Sales"],
    "salary": [1300, 150000, 250000, 1000, 100000, 1000, 2000, 1300, 1300, 1200, 1300, 1300, 1200, 1300, 1200, 1400, 1400, 1000, 2200, 1100, 1000, 1000, 700, 1300, 1200, 1500, 200000, 1000, 2000, 1000],
    "target": [200, 0, 0, 200, 0, 200, 200, 200, 200, 200, 200, 150, 200, 180, 200, 100, 400, 200, 200, 200, 200, 200, 150, 200, 200, 140, 0, 200, 200, 120],
    "bonus": [150, 300, 300, 150, 300, 150, 150, 150, 150, 100, 100, 100, 150, 150, 150, 150, 100, 100, 150, 150, 150, 150, 150, 100, 150, 100, 300, 150, 150, 150],
    "email": ["Max@company.com", "Katty@company.com", "Richerd@company.com", "Jennifer@company.com", "George@company.com", "Laila@company.com", "Sarrah@company.com", "Suzan@company.com", "Mandy@company.com", "Britney@company.com", "Jack@company.com", "Ben@company.com", "Tom@company.com", "Antoney@company.com", "Morgan@company.com", "Molly@company.com", "Molly@company.com", "Molly@company.com", "Mick@company.com", "Shandler@company.com", "Jason@company.com", "Celine@company.com", "Michale@company.com", "Adam@company.com", "Mark@company.com", "Molly@company.com", "Allen@company.com", "Joe@company.com", "Henry@company.com", "Sam@company.com"],
    "city": ["California", "Arizona", "Alabama", "Alabama", "Florida", "Florida", "Florida", "Florida", "Florida", "Florida", "Hawaii", "Hawaii", "Hawaii", "Hawaii", "Hawaii", "Arizona", "Arizona", "Alabama", "Florida", "Arizona", "Arizona", "Colorado", "Colorado", "Alabama", "Alabama", "Alabama", "California", "California", "California", "California"],
    "address": ["2638 Richards Avenue", "", "", "", "1003 Wyatt Street", "3655 Spirit Drive", "1176 Tyler Avenue", "1275 Monroe Avenue", "2510 Maryland Avenue", "3946 Steve Hunt Road", "3762 Stratford Drive", "3055 Indiana Avenue", "801 Stratford Drive", "3533 Randall Drive", "2641  Randall Drive", "3632 Polk Street", "3461 Preston Street", "", "", "", "", "", "", "4541  Ferry Street", "2522  George Avenue", "4832  New Creek Road", "1069 Ventura Drive", "995 Jim Rosa Lane", "1609 Ford Street", "4869 Libby Street"],
    "manager_id": [1, 1, 1, 13, 1, 11, 19, 19, 19, 19, 19, 19, 1, 1, 1, 13, 13, 13, 11, 11, 11, 11, 11, 19, 1, 13, 1, 1, 1, 1]
}

employee = pd.DataFrame(data)

In [3]:
employee.head()

,id,first_name,last_name,age,sex,employee_title,department,salary,target,bonus,email,city,address,manager_id
0,5,Max,George,26,M,Sales,Sales,1300,200,150,Max@company.com,California,2638 Richards Avenue,1
1,13,Katty,Bond,56,F,Manager,Management,150000,0,300,Katty@company.com,Arizona,,1
2,11,Richerd,Gear,57,M,Manager,Management,250000,0,300,Richerd@company.com,Alabama,,1
3,10,Jennifer,Dion,34,F,Sales,Sales,1000,200,150,Jennifer@company.com,Alabama,,13
4,19,George,Joe,50,M,Manager,Management,100000,0,300,George@company.com,Florida,1003 Wyatt Street,1

Find the employee with the highest salary per department.\
Output the department name, employee's first name along with the corresponding salary.

In [33]:
df_highest = employee.groupby(['department'])['salary'].max().reset_index().rename(columns = {'salary': 'highest_salary'})
df_highest

   department  highest_salary
0       Audit            1100
1  Management          250000
2       Sales            2200

In [12]:
# employee[df_highest['department'] == employee['department'] and df_highest['salary'] == employee['salary']]

In [35]:
final_df = pd.merge(df_highest, employee, on = 'department', how = 'right')
#final_df

In [36]:
final_df = final_df[final_df['salary'] == final_df['highest_salary']].drop('salary', axis = 1)#.rename(columns = {'salary_y': 'salary'})
# final_df = final_df.drop('salary_x', axis = 1).rename(columns = {'salary_y': 'salary'})
# final_df

In [38]:
# Output the department name, employee's first name along with the corresponding salary.
final_df[['department', 'first_name', 'highest_salary']]

    department first_name  highest_salary
2   Management    Richerd          250000
18       Sales       Mick            2200
19       Audit   Shandler            1100

In [ ]:
# sql
with cte as (
select *, MAX(salary) OVER(PARTITION BY department) as highest_salary
from employee )

select department, first_name, salary
from cte
where salary = highest_salary;